app/controllers/items_controller.rb

SELECT * FROM `lists` WHERE (`lists`.`id` = 1)
SELECT * FROM `items` WHERE (`items`.list_id = 1)
---
  def index
    #print "hello"
    #print params
    #@list = List.find(params[:list_id])
   # @list = List.find(1)
    #@items = @list.items
    #@items = Item.all
    @list
    @items
    if params[:id]
      @list = List.find( params[:id] )
      #@list = List.find( :all, :name => params[:id] )

      @items = @list.items
    else
      @items = Item.all

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def show
   # @list = List.find(params[:list_id])
   # @items = @list.items.find(params[:id])
    @item = Item.find( params[:id] )

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def edit
    #@list = List.find(params[:list_id])
    @item = Item.find(params[:id])

SELECT * FROM `lists` WHERE (`lists`.`name` = 'tapes' AND `lists`.`owner` = 'crandall') LIMIT 1
INSERT INTO `items` (`updated_at`, `text`, `author`, `fullMessage`, `list_id`, `submitted`, `created_at`) VALUES('2009-08-02 09:42:18', 'blah', '@crandall', 'blah', 1, '2009-08-02', '2009-08-02 09:42:18')
INSERT INTO `lists` (`name`, `updated_at`, `permission`, `owner`, `created_at`) VALUES('tapes', '2009-08-18 11:50:13', 'public', 'crandall', '2009-08-18 11:50:13')
---
  def create

     list_name =  params[:item] [:list_id]
     author =     params[:item] [:author]
     list_owner = params[:item] [:list_owner]
     if not list_owner
       list_owner = author
     end

     @list = List.find( :first,
                        :conditions => { :name => list_name,
                                         :owner => list_owner } )

     #@list = List.find( params[:item] [:list_id] )

     if not @list
       @list = List.new({ "owner"       => params[:item] [:author],
                          "name"        => list_name,
                          "permission"  => "public" } )
       @list.save #TODO error handling here like in list create method

SELECT * FROM `items` WHERE (`items`.`id` = 7)
SELECT * FROM `lists` WHERE (`lists`.`id` = 5)
---
  def update
     @list = List.find( params[:item] [:list_id] )

SELECT * FROM `items` WHERE (`items`.`id` = 1)
DELETE FROM `items` WHERE `id` = 1
---
  def destroy
    @items = Item.find(params[:id])
    @items.destroy