app/controllers/lists_controller.rb

SELECT * FROM `lists`
INSERT INTO `lists` (`name`, `updated_at`, `permission`, `owner`, `created_at`) VALUES('book', '2009-08-28 19:37:56', 'public', 'hyfen', '2009-08-28 19:37:56')
---
  def index
    @lists = List.all

    @owners = Array.new
    List.all.each do |list|
      puts(list.owner)
      @owners.push(list.owner)

SELECT * FROM `lists` WHERE (`lists`.`owner` = 'ed')
---
  def user
    @user = params[:id]
    @lists = List.find(:all, :conditions => { :owner => @user } )

SELECT * FROM `lists`
---
  def owners
    @owners = Array.new
    List.all.each do |list|

SELECT * FROM `lists` WHERE (`lists`.`id` = 1)
---
  def show
    @list = List.find(params[:id])

SELECT * FROM `lists` WHERE (`lists`.`id` = 1)
---
  def edit
    @list = List.find(params[:id])

INSERT INTO `lists` (`name`, `updated_at`, `permission`, `owner`, `created_at`) VALUES('Books', '2009-08-01 09:13:42', 'private', '@isaacezer', '2009-08-01 09:13:42')
---
  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save

SELECT * FROM `lists` WHERE (`lists`.`id` = 1)
UPDATE `lists` SET `updated_at` = '2009-08-18 11:15:56', `name` = 'Music' WHERE `id` = 1
---
  def update
    @list = List.find(params[:id])

    respond_to do |format|
      if @list.update_attributes(params[:list])

SELECT * FROM `lists` WHERE (`lists`.`id` = 1)
DELETE FROM `lists` WHERE `id` = 1
---
  def destroy
    @list = List.find(params[:id])
    @list.destroy